# FlexDuctType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FlexDuctType Class
Members See Also
---
A flex duct type in the Autodesk Revit MEP product.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FlexDuctType : MEPCurveType
```

Visual Basic
---
```text
Public Class FlexDuctType _
	Inherits MEPCurveType
```

Visual C++
---
```text
public ref class FlexDuctType : public MEPCurveType
```

# Remarks
The flex duct type is only available in the Autodesk Revit MEP product.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..HostObjAttributes Autodesk.Revit.DB..::..MEPCurveType Autodesk.Revit.DB.Mechanical..::..FlexDuctType
# See Also
FlexDuctType Members
Autodesk.Revit.DB.Mechanical Namespace